[
    {
        "vacancy": "Python разработчик",
        "link": "https://spb.hh.ru/vacancy/85989567?from=vacancy_search_list&query=Python",
        "description": "\"Все гениальное - изи!\" — не просто девиз, а наша философия. За годы работы мы выполнили более 200 проектов всех уровней сложности и наработали огромный опыт в сфере веб-разработки, поэтому реализация даже самых амбициозных it-проектов для нас — изи! Сейчас у нас несколько вакансий на позицию Python разработчика на разные проекты (как full time, так и part time, вилка указана для парт) Мы предполагаем, что у тебя уже может быть проект и ты ищешь себе подработку длительностью от 6 месяцев. Ниже примеры требований для проектов, на которые мы сейчас ищем разработчиков: Проект 1:- Опыт web-программирования в backend части;- Опыт работы с СУБД postgres;- Опыт промышленный разработки на Python от 4-х лет;- Последний год вы работали в аналогичной должности.Плюсами будет опыт работы с Gitlab;- apache superset;- celery (rabbitmq), redis;- docker, kubernetes. Проект 2- Python 3.x- AsyncIO- PostgreSQL- Знание одного из асинхронных фреймворков (Aiohttp, Sanic, FastApi, Starlette, etc.)- Знание Django/Drf будет плюсом (не критично) Есть и другие проекты, мы подберем для тебя подходящий, учитывая твои скиллы и пожелания. Что нужно будет делать?Зависит от проекта, но в целом:- Реализовать бизнес-процессы;- Участвовать в создании и поддержки крутых продуктов;- Делать код-ревью коллег;- Проектировать реализацию новых процессов. Что предлагаем:- Оформление по удобному для тебя формату (ИП, самозанятость)- График 5/2, парттайм/фуллтайм; гибкое утро;- Рабочее место там, где вам удобно и есть интернет;- Интересные проекты с серьезными задачами в разных областях;- Возможность перемещаться между проектами; Откликайся на вакансию, ждем тебя!",
        "salary": "170 000 – 265 000 ₽",
        "company": "Decart IT-productionМосква"
    },
    {
        "vacancy": "Разработчик Python",
        "link": "https://spb.hh.ru/vacancy/85972606?from=vacancy_search_list&query=Python",
        "description": "Software Developer Python / Django В Inspector Cloud мы создаем сервисы по распознаванию изображений для розничной торговли. Наши клиенты – ведущие производители товаров повседневного спроса в России, Латинской Америке, Юго-Восточной Азии, Ближнем Востоке. На этой должности вы будете работать в команде бекенда над развитием ключевых SaaS сервисов нашей компании. В ваши обязанности будет входить самостоятельное проектирование и реализация модулей бекенда, поддержка и развитие существующего кода, сотрудничество с командами машинного обучения, фронтенда и мобильной разработки в работе над продуктом. Стек технологий бекенда построен на Python 3,Django, Django Rest Framework, Pandas, TensorFlow и PyTorch. Основная база данных – PostgreSQL, также используем Google FireStore. Развитая инфраструктура DevOps: СI/CD, Docker, Kubernetes, мониторинг. Фронтенд на React, нативные мобильные приложения Android и iOS. Для разработки используем Gitlab и Mattermost, приветствуем частично или полностью удаленную работу. Почему надо работать у нас:   Интересные и сложные задачи на переднем крае технологий, возможности для профессионального роста   Возможна полностью удаленная работа, налаженные процессы   Сильная команда бекенда машинного обучения, мобильной разработки, фронтенда, DevOps   Крутые клиенты из топ-10 мировых производителей товаров повседневного спроса   Адекватное и открытое руководство   Обязанности:   Поддержка и развитие существующего кода бекендов различных сервисов компании   Проектирование и разработка новых модулей ПО   Сотрудничество с командами DevOps, компьютерного зрения, фронтенда, мобильной разработки, клиентской поддержки   Требования:   Python, Django, SQL, REST APIs   Опыт проектирования ПО, сложившееся понимание качества ПО   Опыт разработки SaaS сервисов -- плюс   Условия:   Вилка: 120-200 тыс. руб. на руки   Полная занятость, полный рабочий день   Возможность полностью удаленной работы, налаженные процессы   Трудоустройство ТК РФ  ",
        "salary": "120 000 – 200 000 ₽",
        "company": "ООО Инспектор КлаудМосква"
    },
    {
        "vacancy": "Middle Backend Python/Django разработчик",
        "link": "https://spb.hh.ru/vacancy/86527223?from=vacancy_search_list&query=Python",
        "description": "Приглашаем присоединиться к команде Школы программистов. Школа обучает детей на собственной LMS: наша платформа автоматизирует образовательные процессы от поступления до выдачи выпускного свидетельства. Мы научили программированию уже 100 000 учеников. Сейчас мы расширяем команду и ищем Middle Backend Python/Django разработчика. Что нужно будет делать:   Разрабатывать новую функциональность на Python/Django и асинхронных фреймворках;   Работать с легаси кодом, переносить на сервисную архитектуру;   Участвовать в проработке задач;   Писать unit-тесты;   Проводить код ревью;   Принимать участие в планировании.   Что нужно уметь:   Писать простой, чистый код;   Читать и понимать чужой код;   Обосновывать технические решения;   Оценивать сроки и сложность задач;   Разрабатывать сервисы на Django + drf;   Писать идемпотентные задачи на Celery;   Писать эффективные Dockerfile;   Профилировать запросы к Mysql/PostgreSQL;   Пользоваться linux консолью.   Будем очень рады, если ты:   Имеешь опыт frontend разработки на vue/react;   Знаешь или хочешь писать на golang;   Работал с docker-compose, ansible, terraform, k8s;   Работал с брокерами сообщений: Rabbitmq, Nats, Apache Kafka;   Работал с nosql: redis, elasticsearch, clickhouse, mongo.   Мы рады предложить тебе:   Профессиональный рост, систему грейдов с переоценкой уровня каждые полгода;   Работу в коллективе с неформальным стилем общения;   Минимум совещаний и митингов;   Гибкое начало рабочего дня;   Гибридный формат работы, 70/30 офис/удаленка;   Оплачиваемый отпуск 28 дней в год.   В нашей компании предусмотрены следующие этапы подбора:   скрининг интервью;   тестовое задание, либо ревью примеров вашего кода;   техническое собеседование;   знакомство с СТО.  ",
        "salary": "220 000 – 280 000 ₽",
        "company": "ЧУ ДО Московская школа программистовМосква, Ботанический сад и еще 1 "
    },
    {
        "vacancy": "Backend разработчик (Python, Telegram-боты)",
        "link": "https://spb.hh.ru/vacancy/86518551?from=vacancy_search_list&query=Python",
        "description": "Gooroo — сервис, который меняет формат размещения рекламных интеграций в Telegram, предоставляя рекламодателям и блогерам более удобный способ взаимодействия, чем ручное согласование каждого рекламного поста. Наш продукт уже в релизе и постоянно развивается. Мы собираем отзывы от пользователей, чтобы улучшать сервис, а также имеем дорожную карту с интересными задачами. По инфраструктуре и стеку дело обстоит так: основная часть backend задач завязана на телеграм-ботов, сам бэк написан на Python. В команде уже есть бэк-разработчики и тимлид с большим бэкенд бэкграундом, ищем человека для усиления отдела разработки. Чем конкретно тебе предстоит заниматься:  Разрабатывать API для личного кабинета рекламодателя и блогера; Реализовывать взаимодействие с сервисом Airtable; Работать над задачами, связанными с Telegram-ботами; Реализовывать алгоритмы мэтчинга рекламы с Telegram-каналами.  Что необходимо от тебя:  опыт коммерческой разработки клиент-серверных приложений не менее трех лет; уверенные знания языка программирования Python, опыт не менее двух лет; опыт работы со стеком Django, DjangoRestFramework, PostgreSQL не менее двух лет; уверенные знания Celery, работы с фоновыми задачами, оптимизации фоновых процессов; понимание принципов написания API; умение проектировать базы данных; уверенная работа с системами контроля версий; навыки работы с командной строкой на удаленном сервере; знание английского языка, достаточное для чтения технической документации и поиска информации.  Большим плюсом будут:  знания в области создания telegram-ботов; опыт в построении socket-взаимодействия с клиентом; понимание и опыт написания unit-тестов; опыт работы с docker и docker-compose; опыт работы с GitLab CI; знание дополнительных фреймворков, например FastAPI.  Что мы предлагаем:  Фуллтайм с гибким началом дня (до 11 по мск); Полная удаленка без привязки к офису, городу или стране (сотрудники находятся в России, Турции, Таиланде, Грузии и других странах); С первого дня заключаем договор самозанятости или ИП; Классный и очень активно растущий продукт с перспективами и для тебя; Позитивная сплоченная команда с классной корпоративной культурой и отсутствием бюрократии. ",
        "salary": "до 300 000 ₽",
        "company": "GoorooСанкт-Петербург"
    },
    {
        "vacancy": "Разработчик (python)",
        "link": "https://spb.hh.ru/vacancy/86218851?from=vacancy_search_list&query=Python",
        "description": "Обязанности:  Разработка Web-интерфейсов на фреймворке Flask. Взаимодействие с командой разработчиков.  Базовые знания:  Знание Python. Знание Flask. Знание Linux. Знание JavaScript, базовые знания HTML, CSS и Xml. Тестирование разработанного функционала.  Дополнительные знания:  Знание протокола HTTP. Понимание работы Docker, Ansible. Знание REST API. Понимание серверной архитектуры, систем хранения данных и виртуализации. Опыт использования системы контроля версий. Навыки работы с чужим кодом.    Условия:  Оформление по ТК (полностью белая компания). ДМС со стоматологией после прохождения испытательного срока. Оплата 10-ти дней больничного в году по среднегодовому заработку. Офис в пешей доступности от м. Киевская. ",
        "salary": "до 70 000 ₽",
        "company": "ООО Национальные ТехнологииМосква"
    },
    {
        "vacancy": "Python разработчик junior в отдел QA",
        "link": "https://spb.hh.ru/vacancy/86527377?from=vacancy_search_list&query=Python",
        "description": "amoCRM - крупнейшая CRM система в России. Мы помогаем сотням тысяч компаний оказывать лучший сервис для своих клиентов. Мы делаем это в России, США, Европе, Латинской Америке, общаемся с нашими клиентами на 4 языках. Мы помогаем им узнавать и обращаться к своим клиентам по имени, помогаем отвечать на сообщения быстрее, не забывать про встречи или просто отвечать на почту. А на самом деле amoCRM - это совсем небольшая команда из 250 молодых и скромных ребят, которым важно зачем они делают свою работу. Мы ищем к себе в команду Python разработчика в отдел QA, который хотел бы работать и развиваться вместе с нами. У нас нет 2 или даже 3 этапов собеседований. Вы общаетесь сразу с технически сильным руководителем, для максимально комфортных условий на собеседовании Обязанности:  Создание мониторингов Работа с авариями Исправление критических ошибок, используя автоматизации Работа с бекапами Составление схем взаимодействия между сервисами Написание проектов по автоматизации работы Автоматизации процессов QA  Мы хотели бы, чтобы вы:  Знали Python; Знали Jenkins; Умели писать shell скрипты; Работали с MySQL; Работали с Git; Работали с Django; Работали с Linux; Знали ООП; Понимали CI/CD; Знали, что такое REST; Были ответственным, самостоятельным, организованным; Быстро обучались, хотели и умели работать в команде; Стремились учиться и развиваться.  Будет преимуществом, если вы:  Работали с Docker; Понимаете, что такое API и есть опыт работы с API различных сервисов/сайтов /систем; Представляете, что такое система очередей и зачем она нужна;  Умеете структурно мыслить, а также умеете разбивать проект на подзадачи.   Работали с другими языками программирования, например php или go   Мы предлагаем:  Работа над интересным международным проектом в технически сильной команде; Возможность карьерного и профессионального роста; Комфортный офис в шаговой доступности от м. Таганская (работа в московском офисе);  Без бюрократии, дресс-кода. Печенки, чай, кофе.   Факты о проекте:  SOA - архитектура. Ядро и более 30 сервисов, взаимодействующих между собой; Несколько десятков тысяч динамических запросов к бэкендам в секунду; более 10 000 запросов в секунду к бекендам Шардированная база ядра, более 1 млрд. записей по ключевым таблицам; Пишем как на популярных фреймворках, так и на чистом PHP; ",
        "salary": "30 000 – 60 000 ₽",
        "company": "amoCRMМосква, Таганская"
    },
    {
        "vacancy": "Python разработчик",
        "link": "https://spb.hh.ru/vacancy/86216012?from=vacancy_search_list&query=Python",
        "description": "Привет, наш будущий коллега! Мы — idaproject Digital-агентство № 1 в России по работе с крупнейшими компаниями в сфере недвижимости по версии «Рейтинг Рунета» с 2014 года по настоящее время. А еще мы заняли 4 место в рейтинге Хабр.Карьеры лучших IT-работодателей России и вошли в топ 100 лучших работодателей по рейтингу hh. Коротко – мы создаем лучшие цифровые сервисы для сферы недвижимости. Делаем так, чтобы квартиру можно было купить просто, как заказать книжку на озоне — переводим все в онлайн и создаем уникальные продукты. Если когда-то подбирал/а квартиру — с вероятностью в 65% через сервисы, созданные нами. Мы обещаем много сложных и серьезных задач. А еще ты станешь частью крутого комьюнити, получишь менторство при необходимости и сможешь влиять на все продукты компании. Наш стек:Python: Django(DRF), PostgreSQL, Docker, uWSGI/gunicorn, Celery, Redis, Nginx.Почему у нас будет интересно?  Своя большая команда разработки (50+ человек в бэке); Команда профессионалов, которая не оставит одного (есть старшие разработчики, тимлиды); Высоконагруженные проекты (более 5млн пользователей/мес); Есть возможность углубиться в DevOps практики (поработать с Gitlab ci\\cd, Celery, Redis, Nats, Trivy и др.); Выстроенный процесс развития: грейды, ассессменты каждые 3-4 мес, индивидуальные скиллсеты; Работаем с крупнейшими клиентами в сфере недвижимости - ГК Самолет, А101, Главстрой, Глоракс и др.  Чем тебе предстоит заниматься:  разработкой API; интеграцией сторонних сервисов; участием в полном цикле разработки - проектирование, программирование, тестирование, поддержка; контролированием качества кода.  Мы ожидаем от тебя:  уверенное знание python3; знание сетевых протоколов HTTP, WebSocket; продвинутое знание Django (Django REST Framework); знание SQL, опыт работы с PostgreSQL, продвинутое использование ORM; опыт работы с git, OC Linux, контейнерами docker; практический опыт автоматизации развертывания приложений.  Мы предлагаем:  оформление по ТК РФ; работу в аккредитованной IT компании график работы 5/2 в удобных и уютных офисах в пешей доступности от м. Калужская или Воронцовская или на удаленке высокий уровень свободы — есть возможность проверять свои гипотезы, экспериментировать и реально влиять на конечный продукт; дружный коллектив​​ и адекватное руководство; барная зона с кофемашинами Miele, чайная машиной, кофе, молоко, печеньки, пиво и настолки по пятницам, Playstation 5; попадая к нам, ты обретаешь не только коллег, но и 250+ отличных друзей, которые развиваются и интересуются тем же самым чем ты. У нас неформальная атмосфера и никакого dress-code. Никто не предъявляет за опоздания на работу (график плавающий). Все активно встречаются вне работы, играют в игры, ходят в бары и просто ездят в гости.  Давай скорее знакомиться!",
        "company": "idaprojectМосква, Калужская"
    },
    {
        "vacancy": "Python-разработчик",
        "link": "https://spb.hh.ru/vacancy/82532098?from=vacancy_search_list&query=Python",
        "description": "Центр изучения и сетевого мониторинга молодёжной среды – аккредитованная IT-компания, учреждённая по поручению Президента России в октябре 2018 года. Деятельность организации ориентирована на создание IT-решений, направленных на формирования комплексной системы по защите детей и подростков от воздействия негативной информации в сети. Задачи:  Разработка высоконагруженных веб-приложения, используя Python. Активное участие в жизни команды, обсуждениях о построении архитектуры и инфраструктуры приложений.  Необходимый опыт:  Опыт работы с реляционными базами данных. Используем мы их много и, поэтому мы ожидаем что вы знакомы с транзакциями, блокировками, индексами и тд. Большим плюсом будет опыт работы с MySQL и/или PostgreSQL. Каждый день мы обрабатываем десятки миллионов различных операций над внутренними транзакциями, поэтому нам важен опыт работы с multiprocessing, очередями задач (RabbitMQ, Kafka), Celery и аналогами, понимание асинхронности. Опыт построения ETL/ELT pipelines Умение грамотно оформлять сложную бизнес-логику в виде кода, желание покрывать свой код тестами. Будет плюсом понимание Clean Architecture, DDD, SOLID. Опыт работы с Django. Знание особенностей orm-а, лучших практик и проблем.  Ключевые навыки: Python, Flask, Django, FastAPI, SQL, PostgreSQL, No-SQL, CI/CD, RabbitMQ Условия:  Оформление в соответствии с ТК РФ; Заработная плата по результатам собеседования; График работы: 5/2, с 10:00 до 19:00 (есть удаленный формат работы); Повышение квалификации, обучение. ",
        "company": "АНО ЦИСММосква"
    },
    {
        "vacancy": "Backend разработчик на Python (Умный дом/город)",
        "link": "https://spb.hh.ru/vacancy/86708695?from=vacancy_search_list&query=Python",
        "description": "Декаст Инжиниринг — аккредитованная IT-компания, разрабатывающая умные устройства и IoT-решения. Мы делаем умными дома, фабрики и города на основе концепции \"Интернета вещей\". У нас собственное производство датчиков, сенсоров и более сложных устройств, а наши сервисы и приложения работают с тысячами устройств и обрабатывают миллионы сообщений.﻿   В команду software-разработки мы ищем python программиста. Мы используем: Python 3.10+, Django 4+, DRF, Poetry, Pydantic, asyncio, trio, aiohttp, docker и docker-compose, Gitlab и Gitlab-CI, Celery, rabbit-mq, pytest, InfluxDB, PostgreSQL и т. д. Мы не только реализуем новую функциональность, но и обязательно выделяем время на рефакторинг, ревью кода коллег, покрытие тестами, архитектурные обсуждения и новые исследования.     Обязательные требования к кандидату:  Опыт коммерческой разработки в команде на Python от 2-х лет Опыт разработки на Django от 2-х лет Опыт использования git, docker, linux Профильное образование в ИТ    Желательные навыки:  Опыт работы с асинхронным стеком asyncio, aiohttp, aiogram Опыт разработки микросервисной архитектуры и географически распределенной инфраструктуры Интерес к IoT, личное использование различных платформ умного дома    Должностные/функциональные обязанности:  Разработка бекенда облачной IoT-платформы и её Enterprise версии Разработка драйверов поддержки новых умных устройств Разработка интеграций со сторонними системами и умными домами, в т.ч. Яндекс Алиса Разработка бекенда производственного сервиса, выпускающего умные устройства Разработка процессов сборки, тестирования и деплоя    Мы предлагаем:  Оформление в соответствии с ТК РФ Заработная плата - обсуждается Режим работы - полностью удаленный / гибрид / офис Москва, метро Улица 1905 года (по договоренности) Помощь в релокации (при необходимости) ИТ-аккредитация ДМС со стоматологией ",
        "company": "ООО Декаст ИнжинирингМосква, Улица 1905 года"
    },
    {
        "vacancy": "Middle Python developer",
        "link": "https://spb.hh.ru/vacancy/72687504?from=vacancy_search_list&query=Python",
        "description": "Мы занимаемся разработкой и поддержкой собственной информационной системы. Данная системы позволяет собирать и агрегировать данные из различных открытых источников, таких как: социальные сети, форумы, мессенджеры, новостные ресурсы и т.д. Продукт постоянно развивается, появляются новые задачи. От соискателя хотим участия в разработке новых компонент и доработки существующих. Наша компания не занимается разработкой сайтов, мы не ищем WEB разработчика. Django, drf – просьба не беспокоить :) Обязанности:  Написание чистого, понятного кода Ведение (исправление багов, модернизация, улучшение) разработанного микросервиса  Требования:  Уверенное знание Python3 (asyncio, typing, threading) Опыт использования сoncurrent computing, применения примитивов синхронизации Умения использования парадигмы ООП и шаблонов проектирования Знание SQL, опыт работы с ORM и/или query builder (SQLAlchemy, peewee, etc.) Знание и умение работать с брокерами сообщений (RabbitMQ, Kafka, celery, etc.) Опыт работы с веб-фреймворками (flask, fastapi, aiohttp), OpenAPI, сериализаторами (pydantic, marshmallow, etc.) Умение покрывать свой код автотестами (pytest) и использовать линтеры (mypy, flake8, etc.)  Как преимущество:  Опыт работы над продуктами придерживающихся микросервисной архитектуре Опыт работы с NoSQL Опыт оптимизации SQL-запросов Опыт разработки с использованием DDD Понимание устройства дистрибутивов linux  Условия:  Участие в масштабном проекте Работа с интересными задачами Гибкий график работы: 40 часов в неделю Удаленная/офисная работа Возможно сотрудничество как по ТК РФ, так и как по ГПХ (ИП, самозанятый) Чай, кофе, вода, соки, энергетики, печеньки и место для курения в офисе ",
        "salary": "150 000 – 200 000 ₽",
        "company": "ООО СелфсекМосква, Трубная и еще 2 "
    },
    {
        "vacancy": "Python-разработчик",
        "link": "https://spb.hh.ru/vacancy/85232574?from=vacancy_search_list&query=Python",
        "description": "Мы - аккредитованная IT-компания QUALITICA. Мы делаем чат-боты, онлайн-сервисы, сложные интернет-магазины, CRM и ERP и другие проекты. Много интеграций с различными системами (1С, соцсети, платежные системы, СДЭК, Госуслуги – лишь часть). Проекты разные, сложные, есть где приложить силы. Мы работаем с крупными компаниями-заказчиками и агентствами и это возможность быть причастным к нетривиальным историям, увидеть все изнутри. Нас больше 60 человек и мы развиваемся. Ищем python-разработчика (middle, senior), которому сможем предложить участие в интересных проектах. У нас нет жесткой специализации, поэтому проекты разные, скучать не придется. Обычный стек технологий проектов - Python/Django REST + PostgreSQL, Linux, GIT для командной работы. Ожидаем увидеть следующие хард-скилы: Python3. Django Rest. PostgreSQL. WebSocket. Redis. Celery. Docker. Elasticsearch. Linux. HTML/CSS/JS (бога фронтенда не ищем, но хорошее понимание и возможность вносить простые правки должно быть). Что еще хотим увидеть в опыте работы: Уровень middle-senior, обязательно с опытом от 2-3 лет , важен опыт реализации нетиповых коммерческих задач. Приветствуется опыт проектирования систем, очень здорово, если это были CRM и LMS. Важен опыт работы в команде, в том числе опыт декомпозиции задач, рефакторинга чужого кода. Flask (хотя бы на уровне знакомства). Условия:    Удаленная работа в штате компании, полная занятость, стабильность и в финансовом плане, и в плане загрузки интересными проектами.   Оплачиваемая сверхурочная работа. При этом у нас нет культа сверхурочки. Забудь о том времени, когда ты приходил работать за приличный оклад, но отрабатывал так, будто платят два).   Льготы, полагающиеся компании с аккредитацией Минцифры (отсрочка, ипотека).   Своевременная выплата заработной платы и прочие обычные блага в виде больничных, отпусков и пр.   Распределенная команда, сильный крутой тимлид.   Ждем с нетерпением резюме!  ",
        "salary": "100 000 – 150 000 ₽",
        "company": "QualiticaМосква"
    }
]